In [1]:
from sqlalchemy import create_engine
import psycopg2
import pandas as pd
from datetime import datetime
from psycopg2.extensions import ISOLATION_LEVEL_AUTOCOMMIT

## Create a Database under user postgres (Only Run Once)

In [2]:
# Connect to PostgreSQL DBMS
conn = psycopg2.connect("user=postgres password=',./'")
conn.set_isolation_level(ISOLATION_LEVEL_AUTOCOMMIT)

# Obtain a DB Cursor
c = conn.cursor()
c.execute("create database churnrate;")

### 1. First method to copy csv file into a table (using pandas and create_engine)

In [3]:
# Connect to churnrate database just created under user postgres
conn = psycopg2.connect("dbname=churnrate user=postgres password=',./'")

# Get cursor object from the database connection
c = conn.cursor()

In [4]:
df = pd.read_csv('subscriptions.csv')

#### SQL does not recognize date in as dtype string, so lets convert it into datetime

In [5]:
for i in ['subscription_start', 'subscription_end']:
    df[i] = df[i].map(lambda x: str(x))

In [6]:
df.columns

Index(['id', 'subscription_start', 'subscription_end', 'segment'], dtype='object')

In [7]:
df.iloc[0]

id                          1
subscription_start    1/12/16
subscription_end       1/2/17
segment                    87
Name: 0, dtype: object

In [8]:
for i in ['subscription_start', 'subscription_end']:
    df[i] = df[i].map(lambda x: None if x == 'nan' else datetime.strptime(x, '%d/%m/%y'))

In [9]:
# dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:,./@localhost:5432/churnrate')
df.to_sql('subscriptions', engine, if_exists='append', index=False)

In [10]:
pd.read_sql("""
            SELECT *
            FROM subscriptions
""", con=conn)

        id subscription_start subscription_end  segment
0        1         2016-12-01       2017-02-01       87
1        2         2016-12-01       2017-01-24       87
2        3         2016-12-01       2017-03-07       87
3        4         2016-12-01       2017-02-12       87
4        5         2016-12-01       2017-03-09       87
...    ...                ...              ...      ...
1995  1996         2017-03-30              NaT       30
1996  1997         2017-03-30              NaT       30
1997  1998         2017-03-30              NaT       30
1998  1999         2017-03-30              NaT       30
1999  2000         2017-03-30              NaT       30

[2000 rows x 4 columns]

### 2. Second method (using copy_from)

#### Only run create table once

In [11]:
c.execute("""
            CREATE TABLE subscriptions1
             (id int, subscription_start text, subscription_end text, segment int)
""")

In [12]:
# copy csv file into the table
with open('subscriptions.csv', 'r') as f:   # Notice that we don't need the `csv` module.
    next(f)    # Skip the header row.
    c.copy_from(f, 'subscriptions1', sep=',')

conn.commit()

#### The issue with this method is that the file copied into the table does not treat missing values as NULL, see below:

In [13]:
pd.read_sql("""
            SELECT *
            FROM subscriptions1
""", con=conn)

        id subscription_start subscription_end  segment
0        1            1/12/16           1/2/17       87
1        2            1/12/16          24/1/17       87
2        3            1/12/16           7/3/17       87
3        4            1/12/16          12/2/17       87
4        5            1/12/16           9/3/17       87
...    ...                ...              ...      ...
1995  1996            30/3/17                        30
1996  1997            30/3/17                        30
1997  1998            30/3/17                        30
1998  1999            30/3/17                        30
1999  2000            30/3/17                        30

[2000 rows x 4 columns]

## Churn Rate Analysis with subscriptions table

### 1. Inspect table for important info

In [14]:
pd.read_sql("""
            SELECT DISTINCT segment
            FROM subscriptions
""", con=conn)

   segment
0       87
1       30

In [15]:
pd.read_sql("""
            SELECT MIN(subscription_start),
                MAX(subscription_end)
            FROM subscriptions
""", con=conn)

         min        max
0 2016-12-01 2017-03-31

### 2. Calculate the Churn Rate Over first 3 months in different segements, given 31 days of minimum subscription

#### 1. Create a temporary table 'months' including all 3 months of 2017 (2016-12 excluded for minimum subscription).

In [32]:
pd.read_sql("""
            WITH months AS
            (
                SELECT DATE '2017-01-01' AS start_date,
                    DATE'2017-01-31' AS end_date
                UNION
                SELECT DATE'2017-02-01' AS start_date,
                    DATE '2017-02-28' AS end_date
                UNION
                SELECT DATE '2017-03-01' AS start_date,
                    DATE '2017-03-31' AS end_date
            )
            SELECT *
            FROM months
""", con=conn)

   start_date    end_date
0  2017-01-01  2017-01-31
1  2017-03-01  2017-03-31
2  2017-02-01  2017-02-28

#### 2. Create a temporary table 'cross_join' with 'subscription' and 'months'.

In [34]:
pd.read_sql("""
            WITH months AS
            (
                SELECT DATE '2017-01-01' AS start_date,
                    DATE '2017-01-31' AS end_date
                UNION
                SELECT DATE '2017-02-01' AS start_date,
                    DATE '2017-02-28' AS end_date
                UNION
                SELECT DATE '2017-03-01' AS start_date,
                    DATE '2017-03-31' AS end_date
            ),
            cross_join AS
            (
                SELECT *
                FROM subscriptions
                CROSS JOIN
                months
            )
            SELECT *
            FROM cross_join
            LIMIT 10
""", con=conn)

   id subscription_start subscription_end  segment  start_date    end_date
0   1         2016-12-01       2017-02-01       87  2017-01-01  2017-01-31
1   1         2016-12-01       2017-02-01       87  2017-03-01  2017-03-31
2   1         2016-12-01       2017-02-01       87  2017-02-01  2017-02-28
3   2         2016-12-01       2017-01-24       87  2017-01-01  2017-01-31
4   2         2016-12-01       2017-01-24       87  2017-03-01  2017-03-31
5   2         2016-12-01       2017-01-24       87  2017-02-01  2017-02-28
6   3         2016-12-01       2017-03-07       87  2017-01-01  2017-01-31
7   3         2016-12-01       2017-03-07       87  2017-03-01  2017-03-31
8   3         2016-12-01       2017-03-07       87  2017-02-01  2017-02-28
9   4         2016-12-01       2017-02-12       87  2017-01-01  2017-01-31

#### 3. Create a temporary table 'status' determine if customers are active and have cancelled the service with 'cross_join'.

In [35]:
pd.read_sql("""
            WITH months AS
            (
                SELECT DATE '2017-01-01' AS start_date,
                    DATE '2017-01-31' AS end_date
                UNION
                SELECT DATE '2017-02-01' AS start_date,
                    DATE '2017-02-28' AS end_date
                UNION
                SELECT DATE '2017-03-01' AS start_date,
                    DATE'2017-03-31' AS end_date
            ),
            cross_join AS
            (
                SELECT *
                FROM subscriptions
                CROSS JOIN
                months
            ),
            status AS
            (
                SELECT id, start_date AS month, segment,
                    CASE
                        WHEN subscription_start < start_date
                        AND (subscription_end > start_date
                            OR subscription_end IS NULL)
                        THEN 1 ELSE 0 END AS is_active,
                    CASE
                        WHEN subscription_end BETWEEN start_date AND end_date
                        THEN 1 ELSE 0 END AS is_cancelled
                FROM cross_join
            )
            SELECT * FROM status
""", con=conn)

        id       month  segment  is_active  is_cancelled
0        1  2017-01-01       87          1             0
1        1  2017-03-01       87          0             0
2        1  2017-02-01       87          0             1
3        2  2017-01-01       87          1             1
4        2  2017-03-01       87          0             0
...    ...         ...      ...        ...           ...
5995  1999  2017-03-01       30          0             0
5996  1999  2017-02-01       30          0             0
5997  2000  2017-01-01       30          0             0
5998  2000  2017-03-01       30          0             0
5999  2000  2017-02-01       30          0             0

[6000 rows x 5 columns]

#### 4. Create a temporary table 'churn_rate' with user churn rate information.

In [48]:
pd.read_sql("""
            WITH months AS
            (
                SELECT DATE '2017-01-01' AS start_date,
                    DATE '2017-01-31' AS end_date
                UNION
                SELECT DATE '2017-02-01' AS start_date,
                    DATE '2017-02-28' AS end_date
                UNION
                SELECT DATE '2017-03-01' AS start_date,
                    DATE'2017-03-31' AS end_date
            ),
            cross_join AS
            (
                SELECT *
                FROM subscriptions
                CROSS JOIN
                months
            ),
            status AS
            (
                SELECT id, start_date AS month, segment,
                    CASE
                        WHEN subscription_start < start_date
                        AND (subscription_end > start_date
                            OR subscription_end IS NULL)
                        THEN 1 ELSE 0 END AS is_active,
                    CASE
                        WHEN subscription_end BETWEEN start_date AND end_date
                        THEN 1 ELSE 0 END AS is_cancelled
                FROM cross_join
            ),
            churn_rate AS
            (
            SELECT month, segment,
                1.0 * SUM(is_cancelled)/SUM(is_active) AS churn_rate
            from status
            GROUP BY 1,2
            ORDER BY 1
            )
            SELECT *
            FROM churn_rate
            WHERE segment = 87;
""", con=conn)

        month  segment  churn_rate
0  2017-01-01       87    0.251799
1  2017-02-01       87    0.320346
2  2017-03-01       87    0.485876

In [44]:
# The result for segment 30

        month  segment  churn_rate
0  2017-01-01       30    0.075601
1  2017-02-01       30    0.073359
2  2017-03-01       30    0.117318

## It is easy to find that for product 30 the churn rate is significantly lower, which is worth sharing with markeing team for making strategic decisions!